fix(guard): fix the field mapping error in jwtpayload
